In [42]:
import pandas as pd

# series

In [43]:

x=[3,4,5,6]
var =pd.Series(x)
print(var)

0    3
1    4
2    5
3    6
dtype: int64

In [44]:
print(type(var))

<class 'pandas.core.series.Series'>

In [45]:
print(var[2])

5

In [46]:
var=pd.Series(x,index=["a","b","c","d"],dtype="float",name="python")
print(var)

a    3.0
b    4.0
c    5.0
d    6.0
Name: python, dtype: float64

In [47]:
dic={"name":["mahima","kisan","kela"],"age":20}
print(dic)

{'name': ['mahima', 'kisan', 'kela'], 'age': 20}

In [48]:
var1= pd.Series(dic)

In [49]:
print(var1)

name    [mahima, kisan, kela]
age                        20
dtype: object

In [50]:
var3=pd.Series(1234)
var3

0    1234
dtype: int64

In [51]:
var3 = pd.Series(1234,index=[1,2,3,4,5,6])
var3

1    1234
2    1234
3    1234
4    1234
5    1234
6    1234
dtype: int64

In [52]:
var3 = pd.Series(1234,index=[1,2,3,4,5,6])
var4 = pd.Series(1234,index=[1,2,3,4])


var5=(var3+var4)
print(var5)

1    2468.0
2    2468.0
3    2468.0
4    2468.0
5       NaN
6       NaN
dtype: float64

# Dataframe

In [53]:
A=[1,2,3,4,5,6]

var5 =pd.DataFrame(A)
print(var5)

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [54]:
print( type(var5))

<class 'pandas.core.frame.DataFrame'>

In [55]:
B={"a":[1,2,3,4],"s":[2,3,4,5],"d":[4,6,4,3]}

var6 =pd.DataFrame(B)
print(var6)

   a  s  d
0  1  2  4
1  2  3  6
2  3  4  4
3  4  5  3

In [56]:
print(type(var6))

<class 'pandas.core.frame.DataFrame'>

In [57]:
B={"a":[1,2,3,4],"s":[2,3,4,5],"d":[4,6,4,3]}

var6 =pd.DataFrame(B)
print(var6)

   a  s  d
0  1  2  4
1  2  3  6
2  3  4  4
3  4  5  3

In [58]:


var6 =pd.DataFrame(B,columns=["a","s"])
print(var6)

   a  s
0  1  2
1  2  3
2  3  4
3  4  5

In [59]:
var6 =pd.DataFrame(B,columns=["a","s"],index=["M","A","H","I"])
print(var6)

   a  s
M  1  2
A  2  3
H  3  4
I  4  5

In [60]:
var6 =pd.DataFrame(B)
print(var6["a"][3])

4

In [61]:
list_1=[[2,3,4,5,5],[323,24,35,123],[3245,456,234,24]]
var8  =pd.DataFrame(list_1)
var8

      0    1    2    3    4
0     2    3    4    5  5.0
1   323   24   35  123  NaN
2  3245  456  234   24  NaN

In [62]:
print(var8)
print(type(var8))

      0    1    2    3    4
0     2    3    4    5  5.0
1   323   24   35  123  NaN
2  3245  456  234   24  NaN
<class 'pandas.core.frame.DataFrame'>

In [63]:
sr = {"s":pd.Series([1,2,3,4]),"s":pd.Series([1,2,3,4])}
sr

{'s': 0    1
 1    2
 2    3
 3    4
 dtype: int64}

In [64]:
var9 = pd.DataFrame(sr)
print(var9)

   s
0  1
1  2
2  3
3  4

# Arithmetic Operatores

In [65]:
M = pd.DataFrame({'A':[1,2,3],"B":[4,5,6],"C":[9,8,7]})
M

   A  B  C
0  1  4  9
1  2  5  8
2  3  6  7

In [66]:
M["ADD"] = M["A"]+M["B"]
M

   A  B  C  ADD
0  1  4  9    5
1  2  5  8    7
2  3  6  7    9

In [67]:
M["Sub"] = M["A"]-M["B"]
M

   A  B  C  ADD  Sub
0  1  4  9    5   -3
1  2  5  8    7   -3
2  3  6  7    9   -3

In [68]:
M["Multi"] = M["A"]*M["B"]
M

   A  B  C  ADD  Sub  Multi
0  1  4  9    5   -3      4
1  2  5  8    7   -3     10
2  3  6  7    9   -3     18

In [69]:
M["DIV"] = M["A"]/M["B"]
M

   A  B  C  ADD  Sub  Multi   DIV
0  1  4  9    5   -3      4  0.25
1  2  5  8    7   -3     10  0.40
2  3  6  7    9   -3     18  0.50

In [70]:
M[" remainder "] = M["A"]%M["B"]
M

   A  B  C  ADD  Sub  Multi   DIV   remainder
0  1  4  9    5   -3      4  0.25            1
1  2  5  8    7   -3     10  0.40            2
2  3  6  7    9   -3     18  0.50            3

In [71]:
W =pd.DataFrame({"Z":[2,3,35,23],"X":[45,34,34,234],"Y":[98,76,655,43]})
W

    Z    X    Y
0   2   45   98
1   3   34   76
2  35   34  655
3  23  234   43

In [72]:
W["python"]=W["Z"]<=20
W

    Z    X    Y  python
0   2   45   98    True
1   3   34   76    True
2  35   34  655   False
3  23  234   43   False

In [73]:
W["python"]=W["Z"]<=15
W["python_1"]=W["Y"]<=150
W

    Z    X    Y  python  python_1
0   2   45   98    True      True
1   3   34   76    True      True
2  35   34  655   False     False
3  23  234   43   False      True

# Delete AND Insert Function

Insert

In [74]:
In=pd.DataFrame({"s":[86,75,64,23,23],"u":[3,5,87,52,34]})
In

    s   u
0  86   3
1  75   5
2  64  87
3  23  52
4  23  34

In [75]:
In.insert(1,"python",In["s"])#indexnu,columnposition,Data

In [76]:
In

    s  python   u
0  86      86   3
1  75      75   5
2  64      64  87
3  23      23  52
4  23      23  34

In [77]:
In.insert(2,"python_1",[11,22,33,44,55])
In

    s  python  python_1   u
0  86      86        11   3
1  75      75        22   5
2  64      64        33  87
3  23      23        44  52
4  23      23        55  34

In [78]:
In["python_3"]=In["s"][:3]
In

    s  python  python_1   u  python_3
0  86      86        11   3      86.0
1  75      75        22   5      75.0
2  64      64        33  87      64.0
3  23      23        44  52       NaN
4  23      23        55  34       NaN

Delect

In [79]:
In1 = In.pop("u")
In1

0     3
1     5
2    87
3    52
4    34
Name: u, dtype: int64

In [80]:
In

    s  python  python_1  python_3
0  86      86        11      86.0
1  75      75        22      75.0
2  64      64        33      64.0
3  23      23        44       NaN
4  23      23        55       NaN

In [81]:
del In["s"]
In

   python  python_1  python_3
0      86        11      86.0
1      75        22      75.0
2      64        33      64.0
3      23        44       NaN
4      23        55       NaN

# BASIC END

In Pandas, the groupby() function is used to split a DataFrame into groups based on the values in one or more columns. You can then perform operations on these groups, such as calculating summary statistics or applying transformations.

In [85]:
df = pd.DataFrame({
    'City': ['New York', 'New York', 'Los Angeles', 'Los Angeles'],
    'Sales': [100, 200, 150, 300]})

grouped =df.groupby('City')
grouped

In [86]:
for x,y in grouped:
    print(x)
    print(y)

Los Angeles
          City  Sales
2  Los Angeles    150
3  Los Angeles    300
New York
       City  Sales
0  New York    100
1  New York    200

In [87]:
grouped.min()

             Sales
City
Los Angeles    150
New York       100

In [88]:
grouped.max()

             Sales
City
Los Angeles    300
New York       200

In [89]:
conver_into_list=list(grouped)
conver_into_list

[('Los Angeles',
            City  Sales
  2  Los Angeles    150
  3  Los Angeles    300),
 ('New York',
         City  Sales
  0  New York    100
  1  New York    200)]

# Append

The append() method appends a DataFrame-like object at the end of the current DataFrame.

The append() method returns a new DataFrame object, no changes are done with the original DataFrame.

In [94]:
data1 = pd.DataFrame({
  "age": [16, 14, 10],
  "qualified": [True, True, True]
})
data2 = pd.DataFrame({
  "age": [55, 40],
  "qualified": [True, False]
})
print(data1)
print(data2)

   age  qualified
0   16       True
1   14       True
2   10       True
   age  qualified
0   55       True
1   40      False

In [101]:
newdf = data1.append([data2])
newdf

AttributeError: 'DataFrame' object has no attribute 'append'

In [102]:
import pandas as pd

data1 = {
  "age": [16, 14, 10],
  "qualified": [True, True, True]
}
df1 = pd.DataFrame(data1)

data2 = {
  "age": [55, 40],
  "qualified": [True, False]
}
df2 = pd.DataFrame(data2)

newdf = df1.append(df2)

AttributeError: 'DataFrame' object has no attribute 'append'